unklstewy/DOTM_HotBox/sdkconfig.defaults
# ======================================================================
#  SC Terminal — sdkconfig.defaults
#  Target : ESP32-P4  (reTerminal D1001 — ESP32-P4NRW32)
#  Run    : idf.py set-target esp32p4  (once, before first build)
# ======================================================================

# --------------- Target -------------------------------------------------
CONFIG_IDF_TARGET="esp32p4"

# ESP32-P4 silicon revision — reTerminal D1001 ships with silicon v1.3 (FULL=103).
# IDF 6.0.1 defaults to requiring v3.1 (FULL=301); override to v1.0 (FULL=100)
# so the bootloader accepts v1.x chips.
# IMPORTANT: ESP32P4_REV_MIN_100 depends on ESP32P4_SELECTS_REV_LESS_V3 — must be
# set first.  Rev <3.0 and >=3.0 are mutually exclusive silicon lines; reTerminal
# uses the v1.x line.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# --------------- CPU ----------------------------------------------------
CONFIG_ESP32P4_DEFAULT_CPU_FREQ_MHZ_400=y

# --------------- PSRAM (32 MB on-package OCT) ---------------------------
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# --------------- Flash --------------------------------------------------
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --------------- Development Wi-Fi fallback ----------------------------
# Remove or set to n before any production build.
CONFIG_SC_NETWORK_DEV_FALLBACK=y
CONFIG_SC_NETWORK_DEV_SSID="Waterways"
CONFIG_SC_NETWORK_DEV_PSK="RiverS0ng"

# --------------- USB / TinyUSB ------------------------------------------
# TINYUSB_HID_COUNT>0 enables HID and sets CFG_TUD_HID in the build.
# We use 1 HID interface with 2 reports (keyboard + consumer control).
CONFIG_TINYUSB_HID_COUNT=1
# Suppress the esp_tinyusb background task; sc_hid.c runs its own USB poll task.
CONFIG_TINYUSB_NO_DEFAULT_TASK=y
CONFIG_TINYUSB_DESC_USE_ESPRESSIF_VID=n

# --------------- FreeRTOS -----------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_SUPPORT_STATIC_ALLOCATION=y
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=n

# --------------- LVGL Fonts ---------------------------------------------
# 8" 800x1280 display — enable the font sizes used by sc_ui_theme.h
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_36=y

# --------------- Logging ------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y

# --------------- NVS ----------------------------------------------------
CONFIG_NVS_ENCRYPTION=n

# --------------- SPIFFS -------------------------------------------------
CONFIG_SPIFFS_PAGE_SIZE=256
CONFIG_SPIFFS_GC_MAX_RUNS=10
CONFIG_SPIFFS_CACHE=y
CONFIG_SPIFFS_MAX_PARTITIONS=3

CONFIG_ESP_HOST_WIFI_ENABLED=n
CONFIG_ESP_WIFI_REMOTE_ENABLED=y
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
# TX buffer choice (dynamic=1 → sets CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1)
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
# MGMT RX buffer choice (static → sets CONFIG_ESP_WIFI_DYNAMIC_RX_MGMT_BUF=0)
CONFIG_ESP_WIFI_STATIC_RX_MGMT_BUFFER=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=n
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0

CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_IDF_SLAVE_TARGET="esp32c6"
CONFIG_ESP_HOSTED_P4_DEV_BOARD_NONE=y
# SDIO transport (hardware is wired for SDIO, not SPI)
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_HIGH=y
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=13
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CLK_SLOT_1=11
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_CMD_SLOT_1=6
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D0_SLOT_1=7
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D1_4BIT_BUS_SLOT_1=8
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D2_4BIT_BUS_SLOT_1=9
CONFIG_ESP_HOSTED_PRIV_SDIO_PIN_D3_4BIT_BUS_SLOT_1=10
CONFIG_ESP_HOSTED_SLAVE_RESET_ON_EVERY_HOST_BOOTUP=y
CONFIG_ESP_HOSTED_GPIO_SLAVE_RESET_SLAVE=13
CONFIG_ESP_HOSTED_RPC_TASK_STACK=4096
CONFIG_ESP_HOSTED_DFLT_TASK_STACK=3072
CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE=y
CONFIG_ESP_HOSTED_MEM_MONITOR=y
CONFIG_ESP_HOSTED_USE_MEMPOOL=y
CONFIG_ESP_HOSTED_MAX_SIMULTANEOUS_SYNC_RPC_REQUESTS=5
CONFIG_ESP_HOSTED_MAX_SIMULTANEOUS_ASYNC_RPC_REQUESTS=5
CONFIG_ESP_HOSTED_CLI_ENABLED=y
CONFIG_ESP_HOSTED_HOST_TO_ESP_WIFI_DATA_THROTTLE=y
CONFIG_ESP_HOSTED_TO_WIFI_DATA_THROTTLE_HIGH_THRESHOLD=90
CONFIG_ESP_HOSTED_TO_WIFI_DATA_THROTTLE_LOW_THRESHOLD=60
CONFIG_ESP_HOSTED_ENABLE_PEER_DATA_TRANSFER=y
CONFIG_ESP_HOSTED_MAX_CUSTOM_MSG_HANDLERS=3

# --------------- HTTP / WebSocket (built-in IDF) ------------------------
CONFIG_ESP_WEBSOCKET_CLIENT_BUFFER_SIZE=4096
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y

# --------------- HEAP ---------------------------------------------------
CONFIG_HEAP_POISONING_DISABLED=y
CONFIG_HEAP_TRACING_STANDALONE=n

# --------------- Compiler -----------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# --------------- Console ------------------------------------------------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_ESP_CONSOLE_UART=n

# --------------- LVGL OS ------------------------------------------------
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_THREAD_STACK_SIZE=32768
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y

# --------------- LVGL FS ------------------------------------------------
CONFIG_LV_USE_FS_POSIX=y
CONFIG_LV_FS_POSIX_LETTER=83
CONFIG_LV_FS_POSIX_PATH="/sdcard"
CONFIG_LV_FS_POSIX_CACHE_SIZE=16384
CONFIG_LV_CACHE_DEF_SIZE=4194304
CONFIG_LV_IMAGE_HEADER_CACHE_DEF_CNT=64

# --------------- LVGL Vector Graphic & SVG & PNG -----------------
CONFIG_LV_USE_VECTOR_GRAPHIC=y
CONFIG_LV_USE_SVG=y
CONFIG_LV_USE_LODEPNG=y
CONFIG_LV_USE_THORVG=y
CONFIG_LV_USE_THORVG_INTERNAL=y

